adpyke.vscode-sql-formatter
anysphere.pyright
bierner.markdown-preview-github-styles
charliermarsh.ruff
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
ms-python.mypy-type-checker
ms-python.python
ninoseki.vscode-pylens
njpwerner.autodocstring
pkief.material-icon-theme
redhat.vscode-yaml
rid9.datetime
stkb.rewrap
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
whizkydee.material-palenight-theme
yzhang.markdown-all-in-one
